; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v1 ?v5)
             (pred_1 ?v13 ?v8)
             (pred_11 ?v1 ?v8)
             (pred_5 ?v4 ?v1 )
	     (pred_6 ?v1)
             (pred_9 ?v6)
             (pred_12 ?v13)
             (pred_3 ?v8)
             (pred_7 ?v1)
             (pred_4 ?v13)
             (pred_2 ?v1)
             (pred_10 ))



(:action op_3
:parameters (?v2 ?v7 ?v11 ?v12)
:precondition (and (pred_9 ?v2) (pred_9 ?v7) (pred_12 ?v11) (pred_3 ?v12)
          (pred_8 ?v2 ?v7) (pred_1 ?v11 ?v12)
                   (pred_11 ?v7 ?v12) (pred_6 ?v2) 
                   (pred_7 ?v7) (pred_4 ?v11))
:effect (and  (pred_2 ?v7) (not (pred_7 ?v7))))


(:action op_4
:parameters (?v2 ?v3)
:precondition (and (pred_9 ?v2) (pred_9 ?v3)
               (pred_6 ?v2) (pred_8 ?v2 ?v3) (pred_2 ?v3))
:effect (and (pred_6 ?v3) (not (pred_6 ?v2))))

(:action op_5
:parameters (?v2 ?v11)
:precondition (and (pred_9 ?v2) (pred_12 ?v11) 
                  (pred_6 ?v2) (pred_5 ?v11 ?v2) (pred_10 ))
:effect (and (pred_4 ?v11)
   (not (pred_5 ?v11 ?v2)) (not (pred_10 ))))


(:action op_1
:parameters (?v2 ?v9 ?v10)
:precondition (and (pred_9 ?v2) (pred_12 ?v9) (pred_12 ?v10)
                  (pred_6 ?v2) (pred_4 ?v10) (pred_5 ?v9 ?v2))
:effect (and (pred_4 ?v9) (pred_5 ?v10 ?v2)
        (not (pred_4 ?v10)) (not (pred_5 ?v9 ?v2))))

(:action op_2
:parameters (?v2 ?v11)
:precondition (and (pred_9 ?v2) (pred_12 ?v11) 
                  (pred_6 ?v2) (pred_4 ?v11))
:effect (and (pred_10 ) (pred_5 ?v11 ?v2) (not (pred_4 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_05 obj_10 obj_22 obj_27 obj_12 obj_24 obj_19 obj_25 obj_23 obj_16 obj_21 obj_08 obj_18 obj_17 obj_04 obj_03 obj_26 obj_02 obj_32 obj_11 obj_30 obj_31 obj_14 obj_28 obj_15
    obj_09 obj_07 obj_01
    obj_13 obj_06 obj_29 obj_20
    )

    (:init
       (pred_10)

       (pred_9 obj_05)
       (pred_9 obj_10)
       (pred_9 obj_22)
       (pred_9 obj_27)
       (pred_9 obj_12)
       (pred_9 obj_24)
       (pred_9 obj_19)
       (pred_9 obj_25)
       (pred_9 obj_23)
       (pred_9 obj_16)
       (pred_9 obj_21)
       (pred_9 obj_08)
       (pred_9 obj_18)
       (pred_9 obj_17)
       (pred_9 obj_04)
       (pred_9 obj_03)
       (pred_9 obj_26)
       (pred_9 obj_02)
       (pred_9 obj_32)
       (pred_9 obj_11)
       (pred_9 obj_30)
       (pred_9 obj_31)
       (pred_9 obj_14)
       (pred_9 obj_28)
       (pred_9 obj_15)
       (pred_3 obj_09)
       (pred_3 obj_07)
       (pred_3 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_06)
       (pred_12 obj_29)
       (pred_12 obj_20)

       (pred_8 obj_05 obj_24)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_22)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_22 obj_25)
       (pred_8 obj_22 obj_27)
       (pred_8 obj_22 obj_10)
       (pred_8 obj_27 obj_23)
       (pred_8 obj_27 obj_12)
       (pred_8 obj_27 obj_22)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_27)
       (pred_8 obj_24 obj_21)
       (pred_8 obj_24 obj_19)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_19 obj_25)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_24)
       (pred_8 obj_25 obj_18)
       (pred_8 obj_25 obj_23)
       (pred_8 obj_25 obj_22)
       (pred_8 obj_25 obj_19)
       (pred_8 obj_23 obj_17)
       (pred_8 obj_23 obj_16)
       (pred_8 obj_23 obj_27)
       (pred_8 obj_23 obj_25)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_16 obj_23)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_08)
       (pred_8 obj_21 obj_24)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_18)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_08 obj_21)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_17)
       (pred_8 obj_18 obj_25)
       (pred_8 obj_18 obj_08)
       (pred_8 obj_17 obj_32)
       (pred_8 obj_17 obj_04)
       (pred_8 obj_17 obj_23)
       (pred_8 obj_17 obj_18)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_04 obj_17)
       (pred_8 obj_03 obj_30)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_26 obj_31)
       (pred_8 obj_26 obj_02)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_32)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_26)
       (pred_8 obj_32 obj_28)
       (pred_8 obj_32 obj_11)
       (pred_8 obj_32 obj_17)
       (pred_8 obj_32 obj_02)
       (pred_8 obj_11 obj_15)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_32)
       (pred_8 obj_30 obj_31)
       (pred_8 obj_30 obj_03)
       (pred_8 obj_31 obj_14)
       (pred_8 obj_31 obj_26)
       (pred_8 obj_31 obj_30)
       (pred_8 obj_14 obj_28)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_14 obj_31)
       (pred_8 obj_28 obj_15)
       (pred_8 obj_28 obj_32)
       (pred_8 obj_28 obj_14)
       (pred_8 obj_15 obj_11)
       (pred_8 obj_15 obj_28)
       (pred_7 obj_16)
       (pred_7 obj_11)
       (pred_7 obj_31)
       (pred_7 obj_28)
       (pred_11  obj_16 obj_09)
       (pred_11  obj_11 obj_07)
       (pred_11  obj_31 obj_01)
       (pred_11  obj_28 obj_07)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_22)
       (pred_2 obj_27)
       (pred_2 obj_12)
       (pred_2 obj_24)
       (pred_2 obj_19)
       (pred_2 obj_25)
       (pred_2 obj_23)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_03)
       (pred_2 obj_26)
       (pred_2 obj_02)
       (pred_2 obj_32)
       (pred_2 obj_30)
       (pred_2 obj_14)
       (pred_2 obj_15)

       (pred_1  obj_13 obj_09)
       (pred_1  obj_06 obj_07)
       (pred_1  obj_29 obj_01)
       (pred_1  obj_20 obj_09)
       (pred_5 obj_13 obj_10)
       (pred_5 obj_06 obj_24)
       (pred_5 obj_29 obj_21)
       (pred_5 obj_20 obj_25)
       (pred_6 obj_05)
    )

    (:goal (and
       (pred_5 obj_13 obj_27)
       (pred_5 obj_29 obj_10)
       (pred_5 obj_20 obj_23)
    ))
(:constraints
  (always (not (pred_6 obj_22)))
)
)

; plan
1. (op_4 obj_05 obj_10)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_10)
   goals met: 0 of 3
2. (op_4 obj_10 obj_19)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_19)
   goals met: 0 of 3
3. (op_4 obj_19 obj_25)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_25)
   goals met: 0 of 3
4. (op_5 obj_25 obj_20)
   deleted: (pred_5 obj_20 obj_25) (pred_10)
   added: (pred_4 obj_20)
   goals met: 0 of 3
5. (op_4 obj_25 obj_23)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_23)
   goals met: 0 of 3
6. (op_2 obj_23 obj_20)
   deleted: (pred_4 obj_20)
   added: (pred_10) (pred_5 obj_20 obj_23)
   goals met: 1 of 3
7. (op_4 obj_23 obj_25)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_25)
   goals met: 1 of 3
8. (op_4 obj_25 obj_19)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_19)
   goals met: 1 of 3
9. (op_4 obj_19 obj_24)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_24)
   goals met: 1 of 3
10. (op_4 obj_24 obj_21)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_21)
   goals met: 1 of 3
11. (op_5 obj_21 obj_29)
   deleted: (pred_5 obj_29 obj_21) (pred_10)
   added: (pred_4 obj_29)
   goals met: 1 of 3
12. (op_4 obj_21 obj_24)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_24)
   goals met: 1 of 3
13. (op_4 obj_24 obj_05)
   deleted: (pred_6 obj_24)
   added: (pred_6 obj_05)
   goals met: 1 of 3
14. (op_4 obj_05 obj_10)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_10)
   goals met: 1 of 3
15. (op_1 obj_10 obj_13 obj_29)
   deleted: (pred_4 obj_29) (pred_5 obj_13 obj_10)
   added: (pred_4 obj_13) (pred_5 obj_29 obj_10)
   goals met: 2 of 3
16. (op_4 obj_10 obj_19)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_19)
   goals met: 2 of 3
17. (op_4 obj_19 obj_25)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_25)
   goals met: 2 of 3
18. (op_4 obj_25 obj_23)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_23)
   goals met: 2 of 3
19. (op_4 obj_23 obj_27)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_27)
   goals met: 2 of 3
20. (op_2 obj_27 obj_13)
   deleted: (pred_4 obj_13)
   added: (pred_10) (pred_5 obj_13 obj_27)
   goals met: 3 of 3
